In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../input/train.csv")

In [3]:
df.head()

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
4            5         0       3    ...      8.0500   NaN         S

[5 rows x 12 columns]

In [4]:
df[["Survived","Embarked"]].head()

   Survived Embarked
0         0        S
1         1        C
2         1        S
3         1        S
4         0        S

In [5]:
df.shape

(891, 12)

In [6]:
df["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [7]:
df["Embarked"].value_counts(True) # True correcponding to percentage

S    0.724409
C    0.188976
Q    0.086614
Name: Embarked, dtype: float64

In [8]:
df_male = df[df["Sex"] == "male"]
df_male

     PassengerId  Survived  Pclass    ...         Fare        Cabin  Embarked
0              1         0       3    ...       7.2500          NaN         S
4              5         0       3    ...       8.0500          NaN         S
5              6         0       3    ...       8.4583          NaN         Q
6              7         0       1    ...      51.8625          E46         S
7              8         0       3    ...      21.0750          NaN         S
12            13         0       3    ...       8.0500          NaN         S
13            14         0       3    ...      31.2750          NaN         S
16            17         0       3    ...      29.1250          NaN         Q
17            18         1       2    ...      13.0000          NaN         S
20            21         0       2    ...      26.0000          NaN         S
21            22         1       2    ...      13.0000          D56         S
23            24         1       1    ...      35.5000           A6         S
26            27         0       3    ...       7.2250          NaN         C
27            28         0       1    ...     263.0000  C23 C25 C27         S
29            30         0       3    ...       7.8958          NaN         S
30            31         0       1    ...      27.7208          NaN         C
33            34         0       2    ...      10.5000          NaN         S
34            35         0       1    ...      82.1708          NaN         C
35            36         0       1    ...      52.0000          NaN         S
36            37         1       3    ...       7.2292          NaN         C
37            38         0       3    ...       8.0500          NaN         S
42            43         0       3    ...       7.8958          NaN         C
45            46         0       3    ...       8.0500          NaN         S
46            47         0       3    ...      15.5000          NaN         Q
48            49         0       3    ...      21.6792          NaN         C
50            51         0       3    ...      39.6875          NaN         S
51            52         0       3    ...       7.8000          NaN         S
54            55         0       1    ...      61.9792          B30         C
55            56         1       1    ...      35.5000          C52         S
57            58         0       3    ...       7.2292          NaN         C
..           ...       ...     ...    ...          ...          ...       ...
840          841         0       3    ...       7.9250          NaN         S
841          842         0       2    ...      10.5000          NaN         S
843          844         0       3    ...       6.4375          NaN         C
844          845         0       3    ...       8.6625          NaN         S
845          846         0       3    ...       7.5500          NaN         S
846          847         0       3    ...      69.5500          NaN         S
847          848         0       3    ...       7.8958          NaN         C
848          849         0       2    ...      33.0000          NaN         S
850          851         0       3    ...      31.2750          NaN         S
851          852         0       3    ...       7.7750          NaN         S
857          858         1       1    ...      26.5500          E17         S
859          860         0       3    ...       7.2292          NaN         C
860          861         0       3    ...      14.1083          NaN         S
861          862         0       2    ...      11.5000          NaN         S
864          865         0       2    ...      13.0000          NaN         S
867          868         0       1    ...      50.4958          A24         S
868          869         0       3    ...       9.5000          NaN         S
869          870         1       3    ...      11.1333          NaN         S
870          871         0       3    ...       7.8958          NaN         S
872          873         0       1    ...       5.0000  B51 B53 B55         S
873          874         0       3    ...       9.0000          NaN         S
876          877         0       3    ...       9.8458          NaN         S
877          878         0       3    ...       7.8958          NaN         S
878          879         0       3    ...       7.8958          NaN         S
881          882         0       3    ...       7.8958          NaN         S
883          884         0       2    ...      10.5000          NaN         S
884          885         0       3    ...       7.0500          NaN         S
886          887         0       2    ...      13.0000          NaN         S
889          890         1       1    ...      30.0000         C148         C
890          891         0       3    ...       7.7500          NaN         Q

[577 rows x 12 columns]

In [9]:
df["Age"].min()

0.42

In [10]:
df["Age"].max()

80.0

In [23]:
# checking two conditions
df[(df["Sex"] == "female") & (df["Age"] <= 40)].head()

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
8            9         1       3    ...     11.1333   NaN         S
9           10         1       2    ...     30.0708   NaN         C

[5 rows x 12 columns]

In [24]:
male_df = df[(df["Sex"] == "male")]
female_df = df[(df["Sex"] == "female")]

print(male_df.head())
print(female_df.head())

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
4            5         0       3    ...      8.0500   NaN         S
5            6         0       3    ...      8.4583   NaN         Q
6            7         0       1    ...     51.8625   E46         S
7            8         0       3    ...     21.0750   NaN         S

[5 rows x 12 columns]
   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
8            9         1       3    ...     11.1333   NaN         S
9           10         1       2    ...     30.0708   NaN         C

[5 rows x 12 columns]

In [39]:
# Assignment
print("Mean, max and min of MALE passengers :")
print( male_df["Age"].describe().loc[['mean','max','min']])

print("\nMean, max and min of FEMALE passengers :")
print( female_df["Age"].describe().loc[['mean','max','min']])

Mean, max and min of MALE passengers :
mean    30.726645
max     80.000000
min      0.420000
Name: Age, dtype: float64

Mean, max and min of FEMALE passengers :
mean    27.915709
max     63.000000
min      0.750000
Name: Age, dtype: float64

In [55]:
print("\nNo of MALE passengers in each Pclass:")
print(male_df["Pclass"].value_counts())

print("\nNo of FEMALE passengers in each Pclass:")
print(female_df["Pclass"].value_counts())

No of MALE passengers in each Pclass:
3    347
1    122
2    108
Name: Pclass, dtype: int64

No of FEMALE passengers in each Pclass:
3    144
1     94
2     76
Name: Pclass, dtype: int64